Revit 2027 API
InSessionViewSheetSet.Views Property
The views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ViewSet Views { get; set; }
Public Overridable Property Views As ViewSet
	Get
	Set
public:
virtual property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
abstract Views : ViewSet with get, set
override Views : ViewSet with get, set
Property Value
ViewSet
Implements
IViewSheetSet.Views
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input views is null.
InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
Reference
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace